# YOLOv8n with DSConv in C2f blocks and CBAM in the head

nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # Main downsampling layers remain as standard Conv to preserve dimensions ✅
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 6, C2f_DS, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 6, C2f_DS, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [512]]
  - [-1, 1, CBAM, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [256]]
  - [-1, 1, CBAM, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  # Replace C2f with our new C2f_DS module 🚀
  - [-1, 3, C2f_DS, [1024]]
  - [[17, 20, 23], 1, Detect, [nc]]